#include "stdio.h"

int main (){
	//unsigned u_ass_test ;
	volatile int a,b,c;
	
	//getch ();
	//需要“conio.h”头文件，“stdio.h”不支持。
	
	/*格式字符串
	在C中，格式字符串的一般形式为：
		%[标志][输出最小宽度][.精度][长度]格式字符
		(方括号中为可选项)
	
	(1)格式字符
		d 	输出十进制有符号整数
		o 	输出八进制无符号整数
		x|X	输出十六进制无符号整数，x为小写，X为大写。
		u	输出十进制无符号整数
		f	输出六位小数
		e|E	输出指数实数
		g|G	不输出无意义0的实数输出
		c	输出单个字符
		s 	输出字符串
		
	(2)标志字符
		-	结果左对齐，右边填空格
		+	输出符号 (正号或负号)
		#	给出进制标识及省略无意义小数点
		
	(3)输出最小宽度
		用十进制数表示输出的最少位数。
		少于宽度，补以0或空格。
		
	(4)精度
		精度格式符以“.”开头，后跟十进制数
		
	(5)长度
		长度分h&l两种，h按短数据输出，l按长数据输出。
	
	*/
	
	
	
	
	return 0;
}